[
  {
    "path": "posts/2022-07-10-initial-patterns-in-river-flow-data/",
    "title": "Initial patterns in river flow data",
    "description": "Initial patterns in river flow data and their relationship to climatic data.",
    "author": [
      {
        "name": "Logan Herrmeyer",
        "url": {}
      }
    ],
    "date": "2022-07-10",
    "categories": [],
    "contents": "\r\nThe data\r\nI have downloaded data for ten American rivers in different regions\r\nthroughout the US, from the Midwest, the Northeast, the South, and the\r\nWest. These rivers range in size from the wide Mississippi in Baton\r\nRouge, LA, just around 200 miles from it’s delta where it empties into\r\nthe ocean, to the unassuming Peace in Arcadia, FL, lying just a few feet\r\nabove sea level, to the Snake as it flows through the high Snake River\r\nPlain through Idaho Falls, ID.\r\nI downloaded data for these rivers from the US Geological Survey\r\n(USGS). The USGS has many stations for monitoring the flow of hundreds\r\nof different rivers throughout the country, and the data for these\r\nrivers has been recorded for many years, offering a rich data set to\r\npull from.\r\nThe USGS has records going back the furthest for river flow, with\r\nriver water level, or gauge height, data either being only recent, or\r\nnot existing at all. This presents a problem as the height of the river\r\nis necessary to determine if the river has flooded, as rivers generally\r\nhave a certain flood stage height. The USGS helps us with this, as they\r\nprovide what is known as a rating table, which gives an empirical\r\nrelationship between the measured flow of the river, and the height of\r\nthe river. I downloaded this data for each river also, and fit a cubic\r\ncurve to the data in order to calculate the height from the river flow.\r\nThe rating curves are smooth, simple, and monotonic, without significant\r\nirregularities, so a cubic curve does fit well to them.\r\nOne more source of data I pulled in was the Oceanic Niño Index, which\r\nis an index measuring sea surface temperature in the western tropical\r\nPacific. These sea surface temperature anomalies can have significant\r\neffects on weather in many parts of North America, as well as throughout\r\nthe world, especially in the winter season. The El Niño - Southern\r\nOscillation (ENSO) weather pattern has been used to predict river flow\r\nin the past, for example, in the Yangtze River in China.\r\nAnother data source I am pulling in is the monthly ERA5 dataset, from\r\nthe European Centre for Medium-Range Weather Forecasts (ECMWF), which\r\nhas historical weather data, going back to the 1970s, for many different\r\nvariables, such as temperature, precipitation, and snow depth.\r\nParticularly, I am interested in snow depth, as it can help predict\r\nspring flooding in snowy regions, as a high winter snowfall can cause\r\nflooding when the snow melts.\r\nAnnual probability of\r\nflooding\r\nOne thing I discovered when looking at the different rivers, is that\r\nthey have wildly different probabilities of flooding. Here is a\r\nchart:\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-07-10T17:32:19-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-10-test-post/",
    "title": "Test post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Logan Herrmeyer",
        "url": "https://github.com/LHerrmeyer"
      }
    ],
    "date": "2022-07-10",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing,\r\nnative to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-07-10T16:50:48-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-09-welcome-to-my-project/",
    "title": "Welcome to my project",
    "description": "An introduction to my senior project.",
    "author": [
      {
        "name": "Logan Herrmeyer",
        "url": {}
      }
    ],
    "date": "2022-05-09",
    "categories": [],
    "contents": "\r\nFlooding is one of the most costly and common types of natural disaster throughout the world. In the United States, over 90 percent of natural disasters involve flooding, and inflict more damage to both life and property than any other natural hazard.(1)\r\nFlooding in 1997Because of this large hazard, it is is important to prepare for these flooding events ahead of time, to, for example, build structures such as levees and sandbag walls to reduce flooding risk, and to evacuate people and belongings from the potentially flooded area. While modern Numerical Weather Prediction models can predict weather accurately up about ten days in advance (2), these weather models cannot predict the risk of flooding for weeks or months in advance. Ten days may not be enough to adequately prepare for major flooding, but multiple weeks, or even months, gives people more time to sufficiently prepare, and potentially safe lives and property.\r\nMany different climate variables can influence weather in an area weeks or months in advance. For example, El Niño–Southern Oscillation (ENSO), a variation in sea surface temperatures in the tropical Western Pacific Ocean, can have significant impacts on the weather in the US. Generally, during warm, or El Niño events, the northern US has warmer and drier than usual weather, while the southern US has colder and wetter than usual weather. In cold, or, La Niña, events, the opposite generally happens. In cold or mountainous areas, snowpack is another important climate variable that impacts flooding, as snowpack builds for months, and melts later. We can feed this data into a machine learning model to predict how these events impact the probability and expected magnitude of flooding.\r\nFeeding ENSO data into a machine learning model to predict flooding has been used with some success. The monthly flow of the Yangtze, China’s longest river, was predicted in two major flood years and one minor flood year with good accuracy (\\(R^2\\)=0.8) using historical streamflow data, and ENSO data.(3) Particularly, the ENSO data helped determine the timing and magnitude of the flooding event.\r\nThrough climatic variables and historical data, I will predict streamflows of rivers months in advance, and calculate the probability of exceeding flood stage, as well as the predicted maximum streamflow.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-14T22:42:15-06:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Spring 2022 Senior Project",
    "description": "Welcome to our new blog, Spring 2022 Senior Project. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-05-09",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2022-07-10T17:25:52-06:00",
    "input_file": {}
  }
]
